<a href="https://colab.research.google.com/github/DillyWilly112/Filtering_practice/blob/main/Filtering.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
# importing a library
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
import pandas as pd

In [9]:
df = pd.read_csv('/content/drive/MyDrive/PTDataScience/PandasForDataManipulation/mortgages.csv')
df.head()

   Month  Starting Balance  Repayment  ...  New Balance  Mortgage Name  Interest Rate
0      1         400000.00    1686.42  ...    399313.58        30 Year           0.03
1      2         399313.58    1686.42  ...    398625.44        30 Year           0.03
2      3         398625.44    1686.42  ...    397935.58        30 Year           0.03
3      4         397935.58    1686.42  ...    397243.99        30 Year           0.03
4      5         397243.99    1686.42  ...    396550.67        30 Year           0.03

[5 rows x 8 columns]

In [11]:
df['Mortgage Name'].value_counts()

30 Year    720
15 Year    360
Name: Mortgage Name, dtype: int64

In [17]:
mortgage_filter = df['Mortgage Name'] == '30 Year'

In [20]:
df_30yr = df[mortgage_filter]
df_30yr.head()

   Month  Starting Balance  Repayment  ...  New Balance  Mortgage Name  Interest Rate
0      1         400000.00    1686.42  ...    399313.58        30 Year           0.03
1      2         399313.58    1686.42  ...    398625.44        30 Year           0.03
2      3         398625.44    1686.42  ...    397935.58        30 Year           0.03
3      4         397935.58    1686.42  ...    397243.99        30 Year           0.03
4      5         397243.99    1686.42  ...    396550.67        30 Year           0.03

[5 rows x 8 columns]

In [23]:
df.loc[df['Mortgage Name'] == '30 Year', :]

     Month  Starting Balance  ...  Mortgage Name  Interest Rate
0        1         400000.00  ...        30 Year           0.03
1        2         399313.58  ...        30 Year           0.03
2        3         398625.44  ...        30 Year           0.03
3        4         397935.58  ...        30 Year           0.03
4        5         397243.99  ...        30 Year           0.03
..     ...               ...  ...            ...            ...
715    356          10596.54  ...        30 Year           0.05
716    357           8493.40  ...        30 Year           0.05
717    358           6381.49  ...        30 Year           0.05
718    359           4260.78  ...        30 Year           0.05
719    360           2131.24  ...        30 Year           0.05

[720 rows x 8 columns]

In [24]:
df = df.loc[mortgage_filter, :]
df['Mortgage Name'].value_counts()

30 Year    720
Name: Mortgage Name, dtype: int64

In [25]:
df['Interest Rate'].value_counts()

0.03    360
0.05    360
Name: Interest Rate, dtype: int64

In [26]:
df['Interest Paid'].value_counts()

581.78     1
898.95     1
816.13     1
90.12      1
137.24     1
          ..
538.33     1
594.26     1
722.44     1
1276.25    1
1000.00    1
Name: Interest Paid, Length: 720, dtype: int64

In [27]:
df['Interest Rate']==0.03

0       True
1       True
2       True
3       True
4       True
       ...
715    False
716    False
717    False
718    False
719    False
Name: Interest Rate, Length: 720, dtype: bool

In [29]:
interest_filter = df['Interest Rate']==0.03
df = df.loc[interest_filter, :]
df['Interest Rate'].value_counts(dropna = False)

0.03    360
Name: Interest Rate, dtype: int64

In [30]:
df = df.loc[mortgage_filter & interest_filter, :]

In [31]:
df

     Month  Starting Balance  ...  Mortgage Name  Interest Rate
0        1         400000.00  ...        30 Year           0.03
1        2         399313.58  ...        30 Year           0.03
2        3         398625.44  ...        30 Year           0.03
3        4         397935.58  ...        30 Year           0.03
4        5         397243.99  ...        30 Year           0.03
..     ...               ...  ...            ...            ...
355    356           8364.12  ...        30 Year           0.03
356    357           6698.61  ...        30 Year           0.03
357    358           5028.93  ...        30 Year           0.03
358    359           3355.08  ...        30 Year           0.03
359    360           1677.04  ...        30 Year           0.03

[360 rows x 8 columns]